app/controllers/store_controller.rb

def save_order
  @cart = find_cart
  @order = Order.new(params[:order])
  @order.add_line_items_from_cart(@cart)
  if @order.save
---
INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `product_id`, `quantity`, `created_at`) VALUES(1, '2009-05-13 19:59:11', 467.86, 4, 1, '2009-05-13 19:59:11')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('dfgh', '2009-05-13 19:59:11', 'check', 'sdfgh', 'dfgh', '2009-05-13 19:59:11')

def remove_from_cart
  begin
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 3)

def remove_all_from_cart
  begin
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)