app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `created_at`) VALUES('reddo', '719322400.604021972142193', '2009-05-13 17:50:58', '1e4d4e5a553086c3080fb8254d307db1ad0066be', '2009-05-13 17:50:58')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def destroy
    @user = User.find(params[:id])